ERP/src/InformationRegisters/КонфигурацииСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонфигурацииСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаксимумСлотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/СлотыКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СлотыКонфигураций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НазваниеПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСлотаКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСлота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>44</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/CommonModules/СерверыVPN_ВызовСервера/Ext/Module.bsl
Процедура УдалитьКонфигурацию(СерверСсылка, ИмяКонфигурации) Экспорт
	
	НаборЗаписей = РегистрыСведений.КонфигурацииСервера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	НаборЗаписей.Отбор.ИмяКонфигурации.Установить(ИмяКонфигурации);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.СлотыКонфигураций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	НаборЗаписей.Отбор.ИмяКонфигурации.Установить(ИмяКонфигурации);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция СоздатьСлот(КонтрагентСсылка, РегионСсылка=Неопределено)
	
	СерверСсылка = ВыбратьОптимальныйСерверИКонфигурацию(РегионСсылка);
	
КонецФункции

Функция ВыбратьОптимальныйСерверИКонфигурацию(РегионСсылка)
	
	
	// TODO ТУТ ПРОДОЛЖИТЬ
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Сервер.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ СЕРВЕРА_ВТ
	//	|ИЗ
	//	|	Справочник.Сервер КАК Сервер
	//	|ГДЕ
	//	|	(&РегионСсылка = НЕОПРЕДЕЛЕНО
	//	|			ИЛИ Сервер.РегионСервера = &РегионСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(1) КАК КоличествоЗанято,
	//	|	СлотыКонфигураций.Сервер КАК Сервер,
	//	|	СлотыКонфигураций.ИмяКонфигурации КАК ИмяКонфигурации
	//	|ПОМЕСТИТЬ ЗАНЯТО_СЛОТОВ_ВТ
	//	|ИЗ
	//	|	СЕРВЕРА_ВТ КАК СЕРВЕРА_ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СлотыКонфигураций КАК СлотыКонфигураций
	//	|		ПО (СлотыКонфигураций.Сервер = СЕРВЕРА_ВТ.Ссылка)
	//	|ГДЕ
	//	|	СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Удален)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СлотыКонфигураций.Сервер,
	//	|	СлотыКонфигураций.ИмяКонфигурации";
	
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонфигурацииСервера КАК КонфигурацииСервера
		//|			ПО (КонфигурацииСервера.Сервер = СлотыКонфигураций.Сервер
		//|				И КонфигурацииСервера.ИмяКонфигурации = СлотыКонфигураций.ИмяКонфигурации)
КонецФункции
